# Machine Learning Foundation

## Section 1, Part a: Reading Data

# Machine Learning Foundation

## BAB 1 (Membaca Data)

### Tujuan Pembelajaran 
- melakukan koneksi ke database dan membaca data  dari database
- melakukan ekplor input masukan 


### Library yang digunakan 


 - [Pandas](https://pandas.pydata.org/pandas-docs/stable/)
 - [Pandas.read_sql](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_sql.html)
 - [SQLite3](https://docs.python.org/3.6/library/sqlite3.html)

In [2]:
# Imports
import sqlite3 as sq3
import pandas.io.sql as pds
import pandas as pd

### Koneksi Database

Langkah pertama yaitu membuat koneksi ke database menggunakan  python diantaranya :

 - Microsoft SQL Server
 - Postgres
 - MySQL
 - AWS Redshift
 - AWS Aurora
 - Oracle DB
 - Terradata
 - Db2 Family
 - Many, many other

 Namun setiap database memiliki kebutuhan  yang berbeda  dalam proses konfigurasinya.
 Disini akan menggunakan sqlite3  untuk menghubungkan ke databasenya, tapi dengan  library yang lainnya juga seperti :

 
 - [`SQLAlchemy`](https://www.sqlalchemy.org/) 
 - [`psycopg2`](http://initd.org/psycopg/)
 - [`MySQLdb`](http://mysql-python.sourceforge.net/MySQLdb.html)

In [3]:
# inisiasi lokasi database 
# melakukan koneksi ke database
path = 'data/classic_rock.db'
con = sq3.Connection(path)

### Reading data

In [19]:
# Write the query
query = '''
SELECT * 
FROM rock_songs;
'''

# Execute the query
observations = pds.read_sql(query, con)

observations.head()

                     Song        Artist  Release_Year  PlayCount
0        Caught Up in You   .38 Special        1982.0         82
1         Hold On Loosely   .38 Special        1981.0         85
2  Rockin' Into the Night   .38 Special        1980.0         18
3       Art For Arts Sake          10cc        1975.0          1
4              Kryptonite  3 Doors Down        2000.0         13

In [6]:
query = ''' SELECT * FROM rock_songs;'''

#eksekusi  query

df = pds.read_sql(query, con)
df.head()

                     Song        Artist  Release_Year  PlayCount
0        Caught Up in You   .38 Special        1982.0         82
1         Hold On Loosely   .38 Special        1981.0         85
2  Rockin' Into the Night   .38 Special        1980.0         18
3       Art For Arts Sake          10cc        1975.0          1
4              Kryptonite  3 Doors Down        2000.0         13

In [12]:
# We can also run any supported SQL query
# Write the query
query = '''
SELECT Artist, Release_Year, COUNT(*) AS num_songs, AVG(PlayCount) AS avg_plays  
    FROM rock_songs
    GROUP BY Artist, Release_Year
    ORDER BY num_songs desc;
'''

# Execute the query
observations = pds.read_sql(query, con)

observations.head()

         Artist  Release_Year  num_songs  avg_plays
0   The Beatles        1967.0         23   6.565217
1  Led Zeppelin        1969.0         18  21.000000
2   The Beatles        1965.0         15   3.800000
3   The Beatles        1968.0         13  13.000000
4   The Beatles        1969.0         13  15.000000

In [11]:
query = ''' SELECT Artist, release_Year, Count(*) as jumlah_lagu, avg(PlayCount) as average_play
            FROM rock_songs 
            GROUP BY  Artist, Release_Year
            ORDER BY jumlah_lagu desc;'''
df = pds.read_sql(query, con)
df.head()

         Artist  Release_Year  jumlah_lagu  average_play
0   The Beatles        1967.0           23      6.565217
1  Led Zeppelin        1969.0           18     21.000000
2   The Beatles        1965.0           15      3.800000
3   The Beatles        1968.0           13     13.000000
4   The Beatles        1969.0           13     15.000000

##  parameter tambahan

ada beberrapa parameter yang dapat ditambahkan ketika akan mengeksekusi query

 - coerce_float: Mengubah angka menjadi float
 - parse_dates:  mengubah kedalam bentuk tipe waktu 
 - chunksize: Jumlah baris untuk disertakan di setiap bagian
 
Let's have a look at using some of these parameters

In [24]:
query='''
SELECT Artist, Release_Year, COUNT(*) AS num_songs, AVG(PlayCount) AS avg_plays  
    FROM rock_songs
    GROUP BY Artist, Release_Year
    ORDER BY num_songs desc;
'''

# Execute the query

observations_generator = pd.read_sql(query, con,  coerce_float= True , parse_dates= ['Relase_year'],  chunksize= 11)

for index, observation in enumerate(observations_generator):
    if index < 13:
        print(f'observation index :{index}'. format(index))
        display(observation)

observation index :0

           Artist  Release_Year  num_songs  avg_plays
0     The Beatles        1967.0         23   6.565217
1    Led Zeppelin        1969.0         18  21.000000
2     The Beatles        1965.0         15   3.800000
3     The Beatles        1968.0         13  13.000000
4     The Beatles        1969.0         13  15.000000
5    Led Zeppelin        1970.0         12  13.166667
6    Led Zeppelin        1975.0         12  14.166667
7      Pink Floyd        1979.0         11  41.454545
8      Pink Floyd        1973.0         10  29.100000
9       The Doors        1967.0         10  28.900000
10  Fleetwood Mac        1977.0          9  35.666667

observation index :1

               Artist  Release_Year  num_songs  avg_plays
0        Jimi Hendrix        1967.0          9  24.888889
1         The Beatles        1963.0          9   2.444444
2         The Beatles        1964.0          9   3.111111
3          Elton John        1973.0          8  18.500000
4        Led Zeppelin        1971.0          8  47.750000
5        Led Zeppelin        1973.0          8  34.125000
6              Boston        1976.0          7  69.285714
7      Rolling Stones        1969.0          7  36.142857
8           Van Halen        1978.0          7  51.142857
9   Bruce Springsteen        1975.0          6   7.666667
10  Bruce Springsteen        1984.0          6  11.500000

observation index :2

                          Artist  Release_Year  num_songs  avg_plays
0   Creedence Clearwater Revival        1969.0          6  23.833333
1   Creedence Clearwater Revival        1970.0          6  18.833333
2                    Def Leppard        1987.0          6  32.000000
3                        Nirvana        1991.0          6  14.666667
4         Paul McCartney & Wings        1973.0          6  25.500000
5                    The Beatles        1966.0          6   6.000000
6                        The Who        1971.0          6  44.000000
7                          AC/DC        1980.0          5  73.800000
8                      Aerosmith        1975.0          5  50.800000
9                     Billy Joel        1977.0          5  11.200000
10                 Black Sabbath        1970.0          5  30.600000

observation index :3

               Artist  Release_Year  num_songs  avg_plays
0   Bruce Springsteen        1973.0          5        2.6
1              Eagles        1979.0          5       28.0
2       Guns N' Roses        1987.0          5       47.2
3        Led Zeppelin        1979.0          5       33.6
4      Lynyrd Skynyrd        1974.0          5       35.0
5           Metallica        1991.0          5       14.0
6      Rolling Stones        1965.0          5       16.2
7      Rolling Stones        1971.0          5       10.6
8         The Beatles        1970.0          5        7.8
9                  U2        1987.0          5       28.8
10             ZZ Top        1983.0          5       71.4

observation index :4

             Artist  Release_Year  num_songs  avg_plays
0             AC/DC        1979.0          4      24.25
1   Alice In Chains        1992.0          4       1.75
2         Bob Seger        1978.0          4      25.25
3       Bryan Adams        1984.0          4      24.75
4      Dire Straits        1985.0          4      27.50
5            Eagles        1976.0          4      50.50
6      Eric Clapton        1977.0          4      27.50
7     Grateful Dead        1970.0          4       6.75
8    Jackson Browne        1977.0          4      15.75
9   John Mellencamp        1985.0          4      16.75
10   Lynyrd Skynyrd        1973.0          4      50.00

observation index :5

            Artist  Release_Year  num_songs  avg_plays
0      Motley Crue        1989.0          4      12.50
1    Ozzy Osbourne        1980.0          4      23.50
2        Pearl Jam        1991.0          4      14.75
3    Peter Gabriel        1986.0          4      24.00
4       Pink Floyd        1975.0          4      42.75
5       Pink Floyd        1987.0          4      15.50
6            Queen        1977.0          4      30.00
7   Rolling Stones        1966.0          4      26.75
8             Rush        1981.0          4      54.25
9       Steely Dan        1977.0          4       1.75
10      Supertramp        1979.0          4      59.50

observation index :6

          Artist  Release_Year  num_songs  avg_plays
0       The Cars        1984.0          4   9.750000
1      The Doors        1971.0          4  32.750000
2     The Police        1983.0          4  23.500000
3      Van Halen        1982.0          4  24.500000
4      Van Halen        1984.0          4  54.000000
5      Van Halen        1986.0          4  19.250000
6   Van Morrison        1970.0          4   4.250000
7            Yes        1971.0          4  20.000000
8            Yes        1983.0          4  29.250000
9         ZZ Top        1973.0          4  31.750000
10     Aerosmith        1974.0          3  11.666667

observation index :7

                  Artist  Release_Year  num_songs  avg_plays
0              Aerosmith        1987.0          3  33.666667
1              Aerosmith        1989.0          3  33.333333
2              Aerosmith        1993.0          3  16.333333
3           Alice Cooper        1971.0          3  15.333333
4           Alice Cooper        1973.0          3  14.000000
5   Allman Brothers Band        1972.0          3   2.666667
6            Bad Company        1974.0          3  46.000000
7             Billy Joel        1973.0          3  15.333333
8             Billy Joel        1980.0          3  18.333333
9              Bob Dylan        1965.0          3   2.333333
10             Bob Seger        1977.0          3  10.666667

observation index :8

                          Artist  Release_Year  num_songs  avg_plays
0                       Bon Jovi        1986.0          3  74.666667
1              Bruce Springsteen        1978.0          3   1.666667
2                     Cinderella        1988.0          3   1.666667
3          Crosby, Stills & Nash        1969.0          3   4.000000
4   Crosby, Stills, Nash & Young        1970.0          3  16.333333
5                    David Bowie        1972.0          3   8.666667
6                    David Bowie        1975.0          3  31.666667
7                    David Bowie        1983.0          3  11.666667
8                    Deep Purple        1972.0          3  22.000000
9                     Don Henley        1985.0          3  29.666667
10                        Eagles        1972.0          3  35.000000

observation index :9

                 Artist  Release_Year  num_songs  avg_plays
0                Eagles        1975.0          3  38.000000
1            Elton John        1972.0          3  25.666667
2         Fleetwood Mac        1975.0          3  35.666667
3          Foo Fighters        1997.0          3   5.333333
4             Foreigner        1981.0          3  47.000000
5               Genesis        1981.0          3  21.666667
6               Genesis        1983.0          3  17.666667
7   Grand Funk Railroad        1974.0          3   3.666667
8             Green Day        1994.0          3   7.000000
9             Green Day        2004.0          3   5.000000
10                Heart        1976.0          3  81.000000

observation index :10

            Artist  Release_Year  num_songs  avg_plays
0     Janis Joplin        1971.0          3   8.666667
1      Jethro Tull        1971.0          3  28.666667
2     Jimi Hendrix        1968.0          3  50.333333
3          Journey        1978.0          3  73.333333
4          Journey        1983.0          3  38.333333
5             Kiss        1976.0          3  11.000000
6     Led Zeppelin        1982.0          3   4.666667
7   Lynyrd Skynyrd        1977.0          3  30.666667
8        Meat Loaf        1977.0          3   6.666667
9         Montrose        1973.0          3  16.666667
10      Neil Young        1969.0          3  11.000000

observation index :11

                              Artist  Release_Year  num_songs  avg_plays
0                         Neil Young        1972.0          3  11.333333
1                       Night Ranger        1983.0          3  12.000000
2                      Ozzy Osbourne        1981.0          3  20.333333
3                      Ozzy Osbourne        1991.0          3  13.333333
4                        Pat Benatar        1980.0          3  21.333333
5   Paul McCartney & Linda McCartney        1971.0          3   1.333333
6                          Pearl Jam        1994.0          3   6.666667
7                         Pink Floyd        1967.0          3   1.666667
8                              Queen        1976.0          3  43.333333
9                              Queen        1978.0          3  26.000000
10                       Queensryche        1990.0          3   6.000000

observation index :12

               Artist  Release_Year  num_songs  avg_plays
0         Rod Stewart        1971.0          3  23.000000
1      Rolling Stones        1968.0          3  53.666667
2      Rolling Stones        1973.0          3  18.666667
3      Rolling Stones        1978.0          3  70.333333
4      Rolling Stones        1981.0          3  29.333333
5                Rush        1980.0          3  46.333333
6             Santana        1969.0          3  13.333333
7           Scorpions        1984.0          3  29.333333
8            Skid Row        1989.0          3  23.000000
9         Soundgarden        1994.0          3   8.666667
10  Steve Miller Band        1976.0          3  86.000000

In [26]:
list = [1,2,3,4,5]
for index, a in enumerate(list):
     print(f"index : {index}: Value :{a}".format(index,a))

index : 0: Value :1
index : 1: Value :2
index : 2: Value :3
index : 3: Value :4
index : 4: Value :5